{
  "backend/main.mo": "Motoko canister that fetches viral prompts via HTTP outcalls, stores prompt lists, and exposes query methods including a placeholder random prompt picker.",
  "feature_evidence.json": "Metadata report linking a frontend feature update to specific files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend TypeScript, React, and utility files.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme color variables and global UI styling rules.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads main.tsx.",
  "frontend/PLAY_STORE_RELEASE_NOTE.md": "Play Store compliance and release planning document covering policies, risks, testing requirements, and operational guidance.",
  "frontend/src/App.tsx": "Root React component handling navigation between list and detail views, theme syncing, and error-boundary-managed data refresh flows.",
  "frontend/src/components/AboutDialog.tsx": "Dialog component explaining the app’s relationship to viralprompts.in and its live data behavior.",
  "frontend/src/components/AppErrorBoundary.tsx": "Reusable error boundary that displays detailed error UI and supports retry and cache-clearing recovery actions.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and caffeine.ai link.",
  "frontend/src/components/Header.tsx": "App header with branding and controls for theme, settings, and about dialog.",
  "frontend/src/components/PromptDetail.tsx": "Displays a detailed view of a prompt with image, categories, copy/share actions, and like toggling.",
  "frontend/src/components/PromptList.tsx": "Shows a searchable, sortable grid of prompts with like/share controls and cache/error handling.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a dialog for changing theme, spacing, image visibility, and default sort settings.",
  "frontend/src/components/ThemeToggle.tsx": "Button to toggle between light and dark themes using the theme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence.",
  "frontend/src/hooks/useLikedPrompts.ts": "Handles storing, toggling, and checking liked prompt IDs in localStorage.",
  "frontend/src/hooks/useTheme.ts": "Manages theme state, syncing with system preference and persisting to localStorage.",
  "frontend/src/hooks/useUserSettings.ts": "Stores and updates user UI settings with localStorage persistence.",
  "frontend/src/hooks/useViralPrompts.ts": "React Query hook that fetches viral prompts via backend, caches results, and provides refresh and cache‑clearing helpers.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme OKLCH color variables and global background/foreground styling.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity, and global styles.",
  "frontend/src/services/viralPromptsCache.ts": "LocalStorage-based caching for viral prompts with get, set, timestamp, presence check, and clear operations.",
  "frontend/src/services/viralPromptsClient.ts": "Client for fetching and validating viral prompts, including sanitization, structured errors, and JSON parsing.",
  "frontend/src/types/viralPrompts.ts": "Type definitions for ViralPrompt objects and the ViralPromptsResponse structure.",
  "frontend/src/utils/clipboard.ts": "Utility for copying text to the clipboard with fallback for older browsers.",
  "frontend/src/utils/sharePrompt.ts": "Shares a prompt via Web Share API with clipboard fallback and returns share status.",
  "frontend/src/utils/viralPrompts.ts": "Helpers for building image and canonical URLs and parsing how‑to‑use text into steps.",
  "frontend/tailwind.config.js": "Tailwind configuration extending color system, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing state, architecture notes, and completed feature for switching data URL to /data.json."
}