{
  "backend/main.mo": "Motoko actor fetching viral prompt JSON via http outcalls with Cloudflare/error fallback, storing last known good data, and exposing prompt retrieval helpers.",
  "feature_evidence.json": "Feature evidence metadata linking feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose, focusing on prompt fetching, caching, UI components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/style configuration defining color tokens and light/dark theme variables using custom OKLCH palettes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/PLAY_STORE_RELEASE_NOTE.md": "Release and compliance notes for Play Store submission covering policies, risks, testing requirements, privacy, and operational guidelines.",
  "frontend/src/App.tsx": "Main app component wiring prompt fetching, settings, theming, navigation between list/detail, and global error boundary.",
  "frontend/src/components/AboutDialog.tsx": "Modal dialog describing the app, its data source, and usage disclaimers with links to viralprompts.in.",
  "frontend/src/components/AppErrorBoundary.tsx": "A React error boundary that catches render errors and shows a recovery UI with retry and cache-clearing options. It resets when resetKey changes and logs errors to the console.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with attribution, a heart icon, a link to caffeine.ai, and a version label.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding and controls for theme, settings, and the about dialog.",
  "frontend/src/components/PromptDetail.tsx": "Shows a detailed view of a single prompt with image, metadata, categories, liking, copying, sharing, and back navigation. Includes clipboard and share handlers with feedback.",
  "frontend/src/components/PromptList.tsx": "Displays a searchable, sortable list of prompts with filtering, liking, sharing, loading states, and error handling. Supports cache clearing and selecting a prompt for detail view.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a settings dialog allowing users to change theme, spacing, image visibility, and default sort order. Uses user settings and theme hooks to persist preferences.",
  "frontend/src/components/ThemeToggle.tsx": "A button with tooltip that toggles between light and dark themes, respecting system mode when active.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for managing Internet Identity login, state, and AuthClient initialization.",
  "frontend/src/hooks/useLikedPrompts.ts": "Manages a Set of liked prompt IDs with localStorage persistence and helpers to toggle or query liked status.",
  "frontend/src/hooks/useTheme.ts": "Tracks and stores theme preference (light, dark, system) and applies it to the document with system‑theme sync.",
  "frontend/src/hooks/useUserSettings.ts": "Stores and updates user settings such as theme, spacing, image visibility, and default sorting with localStorage sync.",
  "frontend/src/hooks/useViralPrompts.ts": "Fetches viral prompts via backend using React Query with caching, refresh helpers, and cache fallback behavior.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, applied via root and .dark classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/services/viralPromptsCache.ts": "Implements localStorage caching for viral prompts with validation, timestamps, and cache‑clearing utilities.",
  "frontend/src/services/viralPromptsClient.ts": "Fetches and validates viral prompts data with extensive error detection for HTML, Cloudflare blocks, and malformed JSON.",
  "frontend/src/services/viralPromptsParsing.ts": "Preprocesses, sanitizes, and normalizes raw prompt JSON into validated ViralPromptsResponse objects.",
  "frontend/src/types/viralPrompts.ts": "Defines TypeScript types for viral prompts and the API response structure.",
  "frontend/src/utils/clipboard.ts": "Provides a clipboard copy helper using the Clipboard API with a textarea-based fallback.",
  "frontend/src/utils/sharePrompt.ts": "Attempts to share a URL via the Web Share API and falls back to copying the URL to the clipboard.",
  "frontend/src/utils/viralPrompts.ts": "Builds canonical and image URLs and parses multi-line how-to-use text into steps.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Describes project state, including prompt-loading issues and the need to show the app version in the footer."
}