{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence metadata describing implemented features, affected files, components, and confidence.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions of their purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based styles defining light/dark color palettes and base UI tokens.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads the main TypeScript entry point.",
  "frontend/PLAY_STORE_RELEASE_NOTE.md": "Play Store compliance and release planning document covering policies, risks, and operational guidance.",
  "frontend/src/App.tsx": "Main app component handling navigation between list/detail views and wiring settings, theme, and prompt data.",
  "frontend/src/components/AboutDialog.tsx": "Dialog component showing app and content-source information with policy-safe disclosure.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution and external link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding and controls for theme, settings, and the about dialog.",
  "frontend/src/components/PromptDetail.tsx": "Detailed prompt view with image, metadata, copy-to-clipboard, usage steps, and link to full page.",
  "frontend/src/components/PromptList.tsx": "Displays, sorts, and manages refresh/cache states for viral prompt cards with loading and error handling.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a dialog UI for updating user settings such as theme, spacing, image visibility, and sort order.",
  "frontend/src/components/ThemeToggle.tsx": "Renders a button to toggle between light and dark themes using the theme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an auth context for managing Internet Identity login, logout, status, and stored identities.",
  "frontend/src/hooks/useTheme.ts": "Manages theme state with system detection, storage, and DOM updates for light/dark modes.",
  "frontend/src/hooks/useUserSettings.ts": "Stores and updates user settings in localStorage with helpers for modifying individual fields.",
  "frontend/src/hooks/useViralPrompts.ts": "Fetches viral prompts with caching, error fallback, and helpers for refresh and cache clearing.",
  "frontend/src/index.css": "Tailwind CSS base definitions with custom light/dark theme variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/services/viralPromptsCache.ts": "Provides localStorage-based caching for viral prompts, including read/write, validation, timestamp handling, and cache clearing.",
  "frontend/src/services/viralPromptsClient.ts": "Fetches viral prompts JSON with timeout, error handling, and structure validation via a custom FetchError class.",
  "frontend/src/types/viralPrompts.ts": "Defines TypeScript interfaces for ViralPrompt and the ViralPromptsResponse JSON structure.",
  "frontend/src/utils/clipboard.ts": "Implements clipboard copy functionality using the Clipboard API with a textarea fallback.",
  "frontend/src/utils/viralPrompts.ts": "Provides helpers to build image and canonical URLs and to parse howToUse text into steps.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, animations, container settings, and typography/animation plugins.",
  "project_state.json": "Describes project goals, architecture, requirements, and known issues for building a hybrid Android app for viralprompts.in."
}