{
  "kind": "build_request",
  "title": "Fix prompt loading failures and show app version label (v15) in footer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deep-check and fix the prompt-loading pipeline so the app no longer shows “Failed to load prompts” due to (a) network errors and (b) server data format/validation errors when fetching https://viralprompts.in/data.json via the backend canister.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still failed to load prompt error Failed to load prompts\nNetwork connection issue... (Network error)\n\n...Failed to load prompts\nData format error... (Data format error) ... please deep check and fix it"
        ]
      },
      "acceptanceCriteria": [
        "When https://viralprompts.in/data.json returns valid JSON in the supported shape, prompts load successfully without any error banner.",
        "If the upstream response is HTML/Cloudflare/error content, the frontend categorizes it as a Cloudflare/server/network failure (not a “Data format error”) and shows the existing user-friendly guidance.",
        "The backend does not overwrite its last-known-good cached response with an invalid (non-JSON / HTML / blocked) response, so a temporary upstream block does not permanently break subsequent loads.",
        "Retry and “Clear cache & retry” actions still work and do not crash the UI.",
        "All user-facing error strings remain in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a visible app version label to the bottom/footer so users can verify they are on the latest build; display the exact string “v15” in the footer UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "neeche bottom mein version bhi likh ke rakko v 10 v 11 updated h ki old wala show hora vo pta chale v15 bnao is baar ... v15 mention at last"
        ]
      },
      "acceptanceCriteria": [
        "The footer renders a version label that includes “v15” on every page/state of the app (list view and detail view).",
        "The version label is visually unobtrusive and does not break the existing footer layout on mobile or desktop.",
        "The version text is not conditional on network state; it always displays."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Add new external data sources or third-party integrations to bypass Cloudflare beyond the existing backend outcall approach.",
    "Implement real-time updates or push-based prompt refresh.",
    "Change the prompts product features (likes, sharing, search) beyond what is required to fix loading failures and display the version label."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}